<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN""http://www.w3.org/TR/html4/loose.dtd">
<HTML
><HEAD
><TITLE
>gnt-cluster</TITLE
><META
NAME="GENERATOR"
CONTENT="Modular DocBook HTML Stylesheet Version 1.79"></HEAD
><BODY
CLASS="REFENTRY"
BGCOLOR="#FFFFFF"
TEXT="#000000"
LINK="#0000FF"
VLINK="#840084"
ALINK="#0000FF"
><H1
><A
NAME="AEN1"
></A
>gnt-cluster</H1
><DIV
CLASS="REFNAMEDIV"
><A
NAME="AEN14"
></A
><H2
>Name</H2
>gnt-cluster&nbsp;--&nbsp;Ganeti administration, cluster-wide</DIV
><DIV
CLASS="REFSYNOPSISDIV"
><A
NAME="AEN17"
></A
><H2
>Synopsis</H2
><P
><B
CLASS="COMMAND"
>gnt-cluster </B
>  {command} [arguments...]</P
></DIV
><DIV
CLASS="REFSECT1"
><A
NAME="AEN22"
></A
><H2
>DESCRIPTION</H2
><P
>      The <B
CLASS="COMMAND"
>gnt-cluster</B
> is used for cluster-wide
      administration in the Ganeti system.
    </P
></DIV
><DIV
CLASS="REFSECT1"
><A
NAME="AEN26"
></A
><H2
>COMMANDS</H2
><DIV
CLASS="REFSECT2"
><A
NAME="AEN28"
></A
><H3
>ADD-TAGS</H3
><P
><B
CLASS="COMMAND"
>add-tags</B
>  [--from <TT
CLASS="REPLACEABLE"
><I
>file</I
></TT
>] {<TT
CLASS="REPLACEABLE"
><I
>tag</I
></TT
>...}</P
><P
>        Add tags to the cluster. If any of the tags contains invalid
        characters, the entire operation will abort.
      </P
><P
>        If the <CODE
CLASS="OPTION"
>--from</CODE
> option is given, the list of
        tags will be extended with the contents of that file (each
        line becomes a tag). In this case, there is not need to pass
        tags on the command line (if you do, both sources will be
        used). A file name of - will be interpreted as stdin.
      </P
></DIV
><DIV
CLASS="REFSECT2"
><A
NAME="AEN39"
></A
><H3
>COMMAND</H3
><P
><B
CLASS="COMMAND"
>command</B
>  [-n <TT
CLASS="REPLACEABLE"
><I
>node</I
></TT
>] {<TT
CLASS="REPLACEABLE"
><I
>command</I
></TT
>}</P
><P
>        Executes a command on all nodes. If the option
        <CODE
CLASS="OPTION"
>-n</CODE
> is not given, the command will be executed
        on all nodes, otherwise it will be executed only on the
        node(s) specified. Use the option multiple times for running
        it on multiple nodes, like:

        <PRE
CLASS="SCREEN"
>          # gnt-cluster command -n node1.example.com -n node2.example.com date
        </PRE
>

      </P
><P
>        The command is executed serially on the selected nodes. If the
        master node is present in the list, the command will be
        executed last on the master. Regarding the other nodes, the
        execution order is somewhat alphabetic, so that
        node2.example.com will be earlier than node10.example.com but
        after node1.example.com.
      </P
><P
>        So given the node names node1, node2, node3, node10, node11,
        with node3 being the master, the order will be: node1, node2,
        node10, node11, node3.
      </P
><P
>        The command is constructed by concatenating all other command
        line arguments. For example, to list the contents of the
        <TT
CLASS="FILENAME"
>/etc</TT
> directory on all
        nodes, run:

        <PRE
CLASS="SCREEN"
>          # gnt-cluster command ls -l /etc
        </PRE
>

        and the command which will be executed will be
        <SAMP
CLASS="COMPUTEROUTPUT"
>"ls -l /etc"</SAMP
>
      </P
></DIV
><DIV
CLASS="REFSECT2"
><A
NAME="AEN56"
></A
><H3
>COPYFILE</H3
><P
><B
CLASS="COMMAND"
>copyfile</B
>  [--use-replication-network] [-n <TT
CLASS="REPLACEABLE"
><I
>node</I
></TT
>] {<TT
CLASS="REPLACEABLE"
><I
>file</I
></TT
>}</P
><P
>        Copies a file to all or to some nodes. The argument specifies
        the source file (on the current system), the
        <CODE
CLASS="OPTION"
>-n</CODE
> argument specifies the target node, or
        nodes if the option is given multiple times. If
        <CODE
CLASS="OPTION"
>-n</CODE
> is not given at all, the file will be
        copied to all nodes.

        Passing the <CODE
CLASS="OPTION"
>--use-replication-network</CODE
> option
        will cause the copy to be done over the replication network
        (only matters if the primary/secondary IPs are different).

        Example:
        <PRE
CLASS="SCREEN"
>          # gnt-cluster -n node1.example.com -n node2.example.com copyfile /tmp/test
        </PRE
>

        This will copy the file <TT
CLASS="FILENAME"
>/tmp/test</TT
> from
        the current node to the two named nodes.
      </P
></DIV
><DIV
CLASS="REFSECT2"
><A
NAME="AEN71"
></A
><H3
>DESTROY</H3
><P
><B
CLASS="COMMAND"
>destroy</B
>  {--yes-do-it}</P
><P
>        Remove all configuration files related to the cluster, so that
        a <B
CLASS="COMMAND"
>gnt-cluster init</B
> can be done again
        afterwards.
      </P
><P
>        Since this is a dangerous command, you are required to pass
        the argument <TT
CLASS="REPLACEABLE"
><I
>--yes-do-it.</I
></TT
>
      </P
></DIV
><DIV
CLASS="REFSECT2"
><A
NAME="AEN80"
></A
><H3
>GETMASTER</H3
><P
><B
CLASS="COMMAND"
>getmaster</B
> </P
><P
>        Displays the current master node.
      </P
></DIV
><DIV
CLASS="REFSECT2"
><A
NAME="AEN85"
></A
><H3
>INFO</H3
><P
><B
CLASS="COMMAND"
>info</B
>  [--roman]</P
><P
>        Shows runtime cluster information: cluster name, architecture
        (32 or 64 bit), master node, node list and instance list.
      </P
><P
>        Passing the <CODE
CLASS="OPTION"
>--roman</CODE
> option gnt-cluster info will try
        to print its integer fields in a latin friendly way. This allows
        further diffusion of Ganeti among ancient cultures.
      </P
></DIV
><DIV
CLASS="REFSECT2"
><A
NAME="AEN93"
></A
><H3
>INIT</H3
><P
><B
CLASS="COMMAND"
>init</B
> <BR> [-s <TT
CLASS="REPLACEABLE"
><I
>secondary_ip</I
></TT
>]<BR> [--vg-name <TT
CLASS="REPLACEABLE"
><I
>vg-name</I
></TT
>]<BR> [--master-netdev <TT
CLASS="REPLACEABLE"
><I
>interface-name</I
></TT
>]<BR> [-m <TT
CLASS="REPLACEABLE"
><I
>mac-prefix</I
></TT
>]<BR> [--no-lvm-storage]<BR> [--no-etc-hosts]<BR> [--no-ssh-init]<BR> [--file-storage-dir <TT
CLASS="REPLACEABLE"
><I
>dir</I
></TT
>]<BR> [--enabled-hypervisors <TT
CLASS="REPLACEABLE"
><I
>hypervisors</I
></TT
>]<BR> [-t <TT
CLASS="REPLACEABLE"
><I
>hypervisor name</I
></TT
>]<BR> [--hypervisor-parameters <TT
CLASS="REPLACEABLE"
><I
>hypervisor</I
></TT
>:<TT
CLASS="REPLACEABLE"
><I
>hv-param</I
></TT
>=<TT
CLASS="REPLACEABLE"
><I
>value</I
></TT
> [,<TT
CLASS="REPLACEABLE"
><I
>hv-param</I
></TT
>=<TT
CLASS="REPLACEABLE"
><I
>value</I
></TT
>...]]<BR> [--backend-parameters <TT
CLASS="REPLACEABLE"
><I
>be-param</I
></TT
>=<TT
CLASS="REPLACEABLE"
><I
>value</I
></TT
> [,<TT
CLASS="REPLACEABLE"
><I
>be-param</I
></TT
>=<TT
CLASS="REPLACEABLE"
><I
>value</I
></TT
>...]]<BR> [--nic-parameters <TT
CLASS="REPLACEABLE"
><I
>nic-param</I
></TT
>=<TT
CLASS="REPLACEABLE"
><I
>value</I
></TT
> [,<TT
CLASS="REPLACEABLE"
><I
>nic-param</I
></TT
>=<TT
CLASS="REPLACEABLE"
><I
>value</I
></TT
>...]]<BR> [--maintain-node-health  {yes | no}]<BR> [--uid-pool <TT
CLASS="REPLACEABLE"
><I
>user-id pool definition</I
></TT
>]<BR> [-I <TT
CLASS="REPLACEABLE"
><I
>default instance allocator</I
></TT
>]<BR> [--primary-ip-version <TT
CLASS="REPLACEABLE"
><I
>version</I
></TT
>]<BR> [--prealloc-wipe-disks  {yes | no}]<BR> {<TT
CLASS="REPLACEABLE"
><I
>clustername</I
></TT
>}</P
><P
>        This commands is only run once initially on the first node of
        the cluster. It will initialize the cluster configuration and
        setup ssh-keys and more.
      </P
><P
>        Note that the <TT
CLASS="REPLACEABLE"
><I
>clustername</I
></TT
> is not
        any random name. It has to be resolvable to an IP address
        using DNS, and it is best if you give the fully-qualified
        domain name. This hostname must resolve to an IP address
        reserved exclusively for this purpose.
      </P
><P
>        The cluster can run in two modes: single-home or
        dual-homed. In the first case, all traffic (both public
        traffic, inter-node traffic and data replication traffic) goes
        over the same interface. In the dual-homed case, the data
        replication traffic goes over the second network. The
        <CODE
CLASS="OPTION"
>-s</CODE
> option here marks the cluster as
        dual-homed and its parameter represents this node's address on
        the second network. If you initialise the cluster with
        <CODE
CLASS="OPTION"
>-s</CODE
>, all nodes added must have a secondary IP
        as well.
      </P
><P
>        Note that for Ganeti it doesn't matter if the secondary
        network is actually a separate physical network, or is done
        using tunneling, etc. For performance reasons, it's
        recommended to use a separate network, of course.
      </P
><P
>        The <CODE
CLASS="OPTION"
>--vg-name</CODE
> option will let you specify a volume group
        different than "xenvg" for Ganeti to use when creating instance disks.
        This volume group must have the same name on all nodes. Once the
        cluster is initialized this can be altered by using the
        <B
CLASS="COMMAND"
>modify</B
> command. If you don't want to use lvm
        storage at all use the <CODE
CLASS="OPTION"
>--no-lvm-storage</CODE
> option.
        Once the cluster is initialized you can change this setup with the
        <B
CLASS="COMMAND"
>modify</B
> command.
      </P
><P
>        The <CODE
CLASS="OPTION"
>--master-netdev</CODE
> option is useful for specifying a
        different interface on which the master will activate its IP address.
        It's important that all nodes have this interface because you'll need
        it for a master failover.
      </P
><P
>        The <CODE
CLASS="OPTION"
>-m</CODE
> option will let you specify a three byte prefix
        under which the virtual MAC addresses of your instances will be
        generated. The prefix must be specified in the format XX:XX:XX and the
        default is aa:00:00.
      </P
><P
>        The <CODE
CLASS="OPTION"
>--no-lvm-storage</CODE
> option allows you to initialize
        the cluster without lvm support. This means that only instances using
        files as storage backend will be possible to create. Once the cluster
        is initialized you can change this setup with the
        <B
CLASS="COMMAND"
>modify</B
> command.
      </P
><P
>        The <CODE
CLASS="OPTION"
>--no-etc-hosts</CODE
> option allows you to initialize the
        cluster without modifying the <TT
CLASS="FILENAME"
>/etc/hosts</TT
> file.
      </P
><P
>        The <CODE
CLASS="OPTION"
>--no-ssh-init</CODE
> option allows you to initialize the
        cluster without creating or distributing SSH key pairs.
      </P
><P
>        The <CODE
CLASS="OPTION"
>--file-storage-dir</CODE
> option allows you
        set the directory to use for storing the instance disk
        files when using file storage as backend for instance disks.
      </P
><P
>        The <CODE
CLASS="OPTION"
>--enabled-hypervisors</CODE
> option allows you
        to set the list of hypervisors that will be enabled for
        this cluster. Instance hypervisors can only be chosen from
        the list of enabled hypervisors, and the first entry of this list
        will be used by default. Currently, the following hypervisors are
        available:
      </P
><P
>        The <CODE
CLASS="OPTION"
>--prealloc-wipe-disks</CODE
> sets a cluster wide
        configuration value for wiping disks prior to allocation. This
        increases security on instance level as the instance can't
        access untouched data from it's underlying storage.
      </P
><P
>        <P
></P
><DIV
CLASS="VARIABLELIST"
><DL
><DT
>xen-pvm</DT
><DD
><P
>                Xen PVM hypervisor
              </P
></DD
><DT
>xen-hvm</DT
><DD
><P
>                Xen HVM hypervisor
              </P
></DD
><DT
>kvm</DT
><DD
><P
>                Linux KVM hypervisor
              </P
></DD
><DT
>chroot</DT
><DD
><P
>                a simple chroot manager that starts chroot based on a
                script at the root of the filesystem holding the
                chroot
          </P
></DD
><DT
>fake</DT
><DD
><P
>                fake hypervisor for development/testing
              </P
></DD
></DL
></DIV
>
      </P
><P
>        Either a single hypervisor name or a comma-separated list of
        hypervisor names can be specified. If this option is not
        specified, only the xen-pvm hypervisor is enabled by default.
      </P
><P
>        The <CODE
CLASS="OPTION"
>--hypervisor-parameters</CODE
> option allows you
        to set default hypervisor specific parameters for the
        cluster. The format of this option is the name of the
        hypervisor, followed by a colon and a comma-separated list of
        key=value pairs. The keys available for each hypervisors are
        detailed in the <SPAN
CLASS="CITEREFENTRY"
><SPAN
CLASS="REFENTRYTITLE"
>gnt-instance</SPAN
>(8)</SPAN
> man page, in the
        <B
CLASS="COMMAND"
>add</B
> command plus the following parameters
        which are only configurable globally (at cluster level):

        <P
></P
><DIV
CLASS="VARIABLELIST"
><DL
><DT
>migration_port</DT
><DD
><P
>Valid for the Xen PVM and KVM hypervisors.</P
><P
>                This options specifies the TCP port to use for
                live-migration. For Xen, the same port should be
                configured on all nodes in
                the <TT
CLASS="FILENAME"
>/etc/xen/xend-config.sxp</TT
>
                file, under the
                key <SPAN
CLASS="QUOTE"
>"xend-relocation-port"</SPAN
>.
              </P
></DD
><DT
>migration_bandwidth</DT
><DD
><P
>Valid for the KVM hypervisor.</P
><P
>                This option specifies the maximum bandwidth that KVM will
                use for instance live migrations. The value is in MiB/s.
              </P
><P
>This option is only effective with kvm versions &#62;= 78
              and qemu-kvm versions &#62;= 0.10.0.
              </P
></DD
></DL
></DIV
>

      </P
><P
>        The <CODE
CLASS="OPTION"
>--backend-parameters</CODE
> option allows you to set
        the default backend parameters for the cluster. The parameter
        format is a comma-separated list of key=value pairs with the
        following supported keys:
      </P
><P
>        <P
></P
><DIV
CLASS="VARIABLELIST"
><DL
><DT
>vcpus</DT
><DD
><P
>                Number of VCPUs to set for an instance by default, must
                be an integer, will be set to 1 if no specified.
              </P
></DD
><DT
>memory</DT
><DD
><P
>                Amount of memory to allocate for an instance by default,
                can be either an integer or an integer followed by a
                unit (M for mebibytes and G for gibibytes are
                supported), will be set to 128M if not specified.
              </P
></DD
><DT
>auto_balance</DT
><DD
><P
>                Value of the auto_balance flag for instances to use by
                default, will be set to true if not specified.
              </P
></DD
></DL
></DIV
>
      </P
><P
>        The <CODE
CLASS="OPTION"
>--nic-parameters</CODE
> option allows you to set
        the default nic parameters for the cluster. The parameter
        format is a comma-separated list of key=value pairs with the
        following supported keys:
        <P
></P
><DIV
CLASS="VARIABLELIST"
><DL
><DT
>mode</DT
><DD
><P
>                The default nic mode, 'routed' or 'bridged'.
              </P
></DD
><DT
>link</DT
><DD
><P
>                In bridged mode the default NIC bridge. In routed mode it
                represents an hypervisor-vif-script dependent value to allow
                different instance groups. For example under the KVM default
                network script it is interpreted as a routing table number or
                name.
              </P
></DD
></DL
></DIV
>
      </P
><P
>        The option <CODE
CLASS="OPTION"
>--maintain-node-health</CODE
> allows to
        enable/disable automatic maintenance actions on
        nodes. Currently these include automatic shutdown of instances
        and deactivation of DRBD devices on offline nodes; in the
        future it might be extended to automatic removal of unknown
        LVM volumes, etc.
      </P
><P
>        The <CODE
CLASS="OPTION"
>--uid-pool</CODE
> option initializes the user-id pool.
        The <TT
CLASS="REPLACEABLE"
><I
>user-id pool definition</I
></TT
> can contain a
        list of user-ids and/or a list of user-id ranges. The parameter format
        is a comma-separated list of numeric user-ids or user-id ranges.
        The ranges are defined by a lower and higher boundary, separated
        by a dash. The boundaries are inclusive.
        If the <CODE
CLASS="OPTION"
>--uid-pool</CODE
> option is not supplied, the
        user-id pool is initialized to an empty list. An empty list means that
        the user-id pool feature is disabled.
      </P
><P
>        The <CODE
CLASS="OPTION"
>-I (--default-iallocator)</CODE
> option specifies the
        default instance allocator. The instance allocator will be used for
        operations like instance creation, instance and node migration, etc.
        when no manual override is specified. If this option is not specified,
        the default instance allocator will be blank, which means that relevant
        operations will require the administrator to manually specify either an
        instance allocator, or a set of nodes.
        The default iallocator can be changed later using the
        <B
CLASS="COMMAND"
>modify</B
> command.
      </P
><P
>        The <CODE
CLASS="OPTION"
>--primary-ip-version</CODE
> option specifies the
        IP version used for the primary address. Possible values are 4 and
        6 for IPv4 and IPv6, respectively. This option is used when resolving
        node names and the cluster name.
      </P
></DIV
><DIV
CLASS="REFSECT2"
><A
NAME="AEN279"
></A
><H3
>LIST-TAGS</H3
><P
><B
CLASS="COMMAND"
>list-tags</B
> </P
><P
>List the tags of the cluster.</P
></DIV
><DIV
CLASS="REFSECT2"
><A
NAME="AEN284"
></A
><H3
>MASTER-FAILOVER</H3
><P
><B
CLASS="COMMAND"
>master-failover</B
>  [--no-voting]</P
><P
>        Failover the master role to the current node.
      </P
><P
>        The <CODE
CLASS="OPTION"
>--no-voting</CODE
> option skips the remote node agreement
        checks. This is dangerous, but necessary in some cases (for example
        failing over the master role in a 2 node cluster with the original
        master down). If the original master then comes up, it won't be able to
        start its master daemon because it won't have enough votes, but so
        won't the new master, if the master daemon ever needs a restart. You
        can pass <CODE
CLASS="OPTION"
>--no-voting</CODE
> to
        <B
CLASS="COMMAND"
>ganeti-masterd</B
> on the new master to solve this
        problem, and run <B
CLASS="COMMAND"
>gnt-cluster redist-conf</B
> to make
        sure the cluster is consistent again.
      </P
></DIV
><DIV
CLASS="REFSECT2"
><A
NAME="AEN295"
></A
><H3
>MASTER-PING</H3
><P
><B
CLASS="COMMAND"
>master-ping</B
> </P
><P
>        Checks if the master daemon is alive.
      </P
><P
>        If the master daemon is alive and can respond to a basic query
        (the equivalent of <B
CLASS="COMMAND"
>gnt-cluster info</B
>), then
        the exit code of the command will be 0. If the master daemon
        is not alive (either due to a crash or because this is not the
        master node), the exit code will be 1.
      </P
></DIV
><DIV
CLASS="REFSECT2"
><A
NAME="AEN302"
></A
><H3
>MODIFY</H3
><P
><B
CLASS="COMMAND"
>modify</B
> <BR> [--vg-name <TT
CLASS="REPLACEABLE"
><I
>vg-name</I
></TT
>]<BR> [--no-lvm-storage]<BR> [--enabled-hypervisors
        <TT
CLASS="REPLACEABLE"
><I
>hypervisors</I
></TT
>]<BR> [--hypervisor-parameters <TT
CLASS="REPLACEABLE"
><I
>hypervisor</I
></TT
>:<TT
CLASS="REPLACEABLE"
><I
>hv-param</I
></TT
>=<TT
CLASS="REPLACEABLE"
><I
>value</I
></TT
> [,<TT
CLASS="REPLACEABLE"
><I
>hv-param</I
></TT
>=<TT
CLASS="REPLACEABLE"
><I
>value</I
></TT
>...]]<BR> [--backend-parameters <TT
CLASS="REPLACEABLE"
><I
>be-param</I
></TT
>=<TT
CLASS="REPLACEABLE"
><I
>value</I
></TT
> [,<TT
CLASS="REPLACEABLE"
><I
>be-param</I
></TT
>=<TT
CLASS="REPLACEABLE"
><I
>value</I
></TT
>...]]<BR> [--nic-parameters <TT
CLASS="REPLACEABLE"
><I
>nic-param</I
></TT
>=<TT
CLASS="REPLACEABLE"
><I
>value</I
></TT
> [,<TT
CLASS="REPLACEABLE"
><I
>nic-param</I
></TT
>=<TT
CLASS="REPLACEABLE"
><I
>value</I
></TT
>...]]<BR> [--uid-pool <TT
CLASS="REPLACEABLE"
><I
>user-id pool definition</I
></TT
>]<BR> [--add-uids <TT
CLASS="REPLACEABLE"
><I
>user-id pool definition</I
></TT
>]<BR> [--remove-uids <TT
CLASS="REPLACEABLE"
><I
>user-id pool definition</I
></TT
>]<BR> [-C <TT
CLASS="REPLACEABLE"
><I
>candidate_pool_size</I
></TT
>]<BR> [--maintain-node-health  {yes | no}]<BR> [--prealloc-wipe-disks  {yes | no}]<BR> [-I <TT
CLASS="REPLACEABLE"
><I
>default instance allocator</I
></TT
>]<BR> [--reserved-lvs=<TT
CLASS="REPLACEABLE"
><I
>NAMES</I
></TT
>]</P
><P
>          Modify the options for the cluster.
        </P
><P
>          The <CODE
CLASS="OPTION"
>--vg-name</CODE
>, <CODE
CLASS="OPTION"
>--no-lvm-storarge</CODE
>,
          <CODE
CLASS="OPTION"
>--enabled-hypervisors</CODE
>,
          <CODE
CLASS="OPTION"
>--hypervisor-parameters</CODE
>,
          <CODE
CLASS="OPTION"
>--backend-parameters</CODE
>,
          <CODE
CLASS="OPTION"
>--nic-parameters</CODE
>,
          <CODE
CLASS="OPTION"
>--maintain-node-health</CODE
>,
          <CODE
CLASS="OPTION"
>--prealloc-wipe-disks</CODE
>,
          <CODE
CLASS="OPTION"
>--uid-pool</CODE
> options are described in
          the <B
CLASS="COMMAND"
>init</B
> command.
        </P
><P
>        The <CODE
CLASS="OPTION"
>-C</CODE
> option specifies the
        <CODE
CLASS="VARNAME"
>candidate_pool_size</CODE
> cluster parameter. This
        is the number of nodes that the master will try to keep as
        <TT
CLASS="LITERAL"
>master_candidates</TT
>. For more details about
        this role and other node roles, see the <SPAN
CLASS="CITEREFENTRY"
><SPAN
CLASS="REFENTRYTITLE"
>ganeti</SPAN
>(7)</SPAN
>. If you increase the size, the master will
        automatically promote as many nodes as required and possible
        to reach the intended number.
      </P
><P
>        The <CODE
CLASS="OPTION"
>--add-uids</CODE
> and <CODE
CLASS="OPTION"
>--remove-uids</CODE
>
        options can be used to modify the user-id pool by adding/removing
        a list of user-ids or user-id ranges.
      </P
><P
>        The option <CODE
CLASS="OPTION"
>--reserved-lvs</CODE
> specifies a list
        (comma-separated) of logical volume group names (regular
        expressions) that will be ignored by the cluster verify
        operation. This is useful if the volume group used for Ganeti
        is shared with the system for other uses. Note that it's not
        recommended to create and mark as ignored logical volume names
        which match Ganeti's own name format (starting with UUID and
        then <TT
CLASS="LITERAL"
>.diskN</TT
>), as this option only skips the
        verification, but not the actual use of the names given.
      </P
><P
>        To remove all reserved logical volumes, pass in an empty
        argument to the option, as in <CODE
CLASS="OPTION"
>--reserved-lvs=</CODE
>
        or <CODE
CLASS="OPTION"
>--reserved-lvs ''</CODE
>.
      </P
><P
>        The <CODE
CLASS="OPTION"
>-I</CODE
> is described in
        the <B
CLASS="COMMAND"
>init</B
> command. To clear the default
        iallocator, just pass an empty string (<TT
CLASS="LITERAL"
>''</TT
>).
      </P
></DIV
><DIV
CLASS="REFSECT2"
><A
NAME="AEN396"
></A
><H3
>QUEUE</H3
><P
><B
CLASS="COMMAND"
>queue</B
>  [drain] [undrain] [info]</P
><P
>        Change job queue properties.
      </P
><P
>        The <CODE
CLASS="OPTION"
>drain</CODE
> option sets the drain flag on the
        job queue. No new jobs will be accepted, but jobs already in
        the queue will be processed.
      </P
><P
>        The <CODE
CLASS="OPTION"
>undrain</CODE
> will unset the drain flag on the
        job queue. New jobs will be accepted.
      </P
><P
>        The <CODE
CLASS="OPTION"
>info</CODE
> option shows the properties of the
        job queue.
      </P
></DIV
><DIV
CLASS="REFSECT2"
><A
NAME="AEN410"
></A
><H3
>WATCHER</H3
><P
><B
CLASS="COMMAND"
>watcher</B
>  {pause <TT
CLASS="REPLACEABLE"
><I
>duration</I
></TT
> | continue | info}</P
><P
>        Make the watcher pause or let it continue.
      </P
><P
>        The <CODE
CLASS="OPTION"
>pause</CODE
> option causes the watcher to pause for
        <TT
CLASS="REPLACEABLE"
><I
>duration</I
></TT
> seconds.
      </P
><P
>        The <CODE
CLASS="OPTION"
>continue</CODE
> option will let the watcher continue.
      </P
><P
>        The <CODE
CLASS="OPTION"
>info</CODE
> option shows whether the watcher is currently
        paused.
      </P
></DIV
><DIV
CLASS="REFSECT2"
><A
NAME="AEN427"
></A
><H3
>redist-conf</H3
><P
><B
CLASS="COMMAND"
>redist-conf</B
>  [--submit]</P
><P
>        This command forces a full push of configuration files from
        the master node to the other nodes in the cluster. This is
        normally not needed, but can be run if the
        <B
CLASS="COMMAND"
>verify</B
> complains about configuration
        mismatches.
      </P
><P
>        The <CODE
CLASS="OPTION"
>--submit</CODE
> option is used to send the job
        to the master daemon but not wait for its completion. The job
        ID will be shown so that it can be examined via
        <B
CLASS="COMMAND"
>gnt-job info</B
>.
      </P
></DIV
><DIV
CLASS="REFSECT2"
><A
NAME="AEN437"
></A
><H3
>REMOVE-TAGS</H3
><P
><B
CLASS="COMMAND"
>remove-tags</B
>  [--from <TT
CLASS="REPLACEABLE"
><I
>file</I
></TT
>] {<TT
CLASS="REPLACEABLE"
><I
>tag</I
></TT
>...}</P
><P
>        Remove tags from the cluster. If any of the tags are not
        existing on the cluster, the entire operation will abort.
      </P
><P
>        If the <CODE
CLASS="OPTION"
>--from</CODE
> option is given, the list of
        tags will be extended with the contents of that file (each
        line becomes a tag). In this case, there is not need to pass
        tags on the command line (if you do, both sources will be
        used). A file name of - will be interpreted as stdin.
      </P
></DIV
><DIV
CLASS="REFSECT2"
><A
NAME="AEN448"
></A
><H3
>RENAME</H3
><P
><B
CLASS="COMMAND"
>rename</B
>  [-f] {<TT
CLASS="REPLACEABLE"
><I
>name</I
></TT
>}</P
><P
>        Renames the cluster and in the process updates the master IP
        address to the one the new name resolves to. At least one of
        either the name or the IP address must be different, otherwise
        the operation will be aborted.
      </P
><P
>        Note that since this command can be dangerous (especially when
        run over SSH), the command will require confirmation unless
        run with the <CODE
CLASS="OPTION"
>-f</CODE
> option.
      </P
></DIV
><DIV
CLASS="REFSECT2"
><A
NAME="AEN458"
></A
><H3
>RENEW-CRYPTO</H3
><P
><B
CLASS="COMMAND"
>renew-crypto</B
>  [-f]<BR> [--new-cluster-certificate] [--new-confd-hmac-key]<BR> [--new-rapi-certificate] [--rapi-certificate <TT
CLASS="REPLACEABLE"
><I
>rapi-cert</I
></TT
>]<BR> [--new-cluster-domain-secret] [--cluster-domain-secret <TT
CLASS="REPLACEABLE"
><I
>filename</I
></TT
>]</P
><P
>        This command will stop all
        Ganeti daemons in the cluster and start them again once the new
        certificates and keys are replicated. The options
        <CODE
CLASS="OPTION"
>--new-cluster-certificate</CODE
> and
        <CODE
CLASS="OPTION"
>--new-confd-hmac-key</CODE
> can be used to regenerate the
        cluster-internal SSL certificate respective the HMAC key used by
        <SPAN
CLASS="CITEREFENTRY"
><SPAN
CLASS="REFENTRYTITLE"
>ganeti-confd</SPAN
>(8)</SPAN
>.
      </P
><P
>        To generate a new self-signed RAPI certificate (used by <SPAN
CLASS="CITEREFENTRY"
><SPAN
CLASS="REFENTRYTITLE"
>ganeti-rapi</SPAN
>(8)</SPAN
>) specify <CODE
CLASS="OPTION"
>--new-rapi-certificate</CODE
>. If
        you want to use your own certificate, e.g. one signed by a certificate
        authority (CA), pass its filename to
        <CODE
CLASS="OPTION"
>--rapi-certificate</CODE
>.
      </P
><P
>        <CODE
CLASS="OPTION"
>--new-cluster-domain-secret</CODE
> generates a new, random
        cluster domain secret. <CODE
CLASS="OPTION"
>--cluster-domain-secret</CODE
> reads
        the secret from a file. The cluster domain secret is used to sign
        information exchanged between separate clusters via a third party.
      </P
></DIV
><DIV
CLASS="REFSECT2"
><A
NAME="AEN489"
></A
><H3
>REPAIR-DISK-SIZES</H3
><P
><B
CLASS="COMMAND"
>repair-disk-sizes</B
>  [instance...]</P
><P
>        This command checks that the recorded size of the given
        instance's disks matches the actual size and updates any
        mismatches found. This is needed if the Ganeti configuration
        is no longer consistent with reality, as it will impact some
        disk operations. If no arguments are given, all instances will
        be checked.
      </P
><P
>        Note that only active disks can be checked by this command; in
        case a disk cannot be activated it's advised to use
        <B
CLASS="COMMAND"
>gnt-instance activate-disks --ignore-size ...</B
> to
        force activation without regard to the
        current size.
      </P
><P
>        When the all disk sizes are consistent, the command will
        return no output. Otherwise it will log details about the
        inconsistencies in the configuration.
      </P
></DIV
><DIV
CLASS="REFSECT2"
><A
NAME="AEN498"
></A
><H3
>SEARCH-TAGS</H3
><P
><B
CLASS="COMMAND"
>search-tags</B
>  {<TT
CLASS="REPLACEABLE"
><I
>pattern</I
></TT
>}</P
><P
>        Searches the tags on all objects in the cluster (the cluster
        itself, the nodes and the instances) for a given pattern. The
        pattern is interpreted as a regular expression and a search
        will be done on it (i.e. the given pattern is not anchored to
        the beggining of the string; if you want that, prefix the
        pattern with <TT
CLASS="LITERAL"
>^</TT
>).
      </P
><P
>        If no tags are matching the pattern, the exit code of the
        command will be one. If there is at least one match, the exit
        code will be zero. Each match is listed on one line, the
        object and the tag separated by a space. The cluster will be
        listed as <TT
CLASS="FILENAME"
>/cluster</TT
>, a node will be listed
        as
        <TT
CLASS="FILENAME"
>/nodes/<TT
CLASS="REPLACEABLE"
><I
>name</I
></TT
></TT
>,
        and an instance as
        <TT
CLASS="FILENAME"
>/instances/<TT
CLASS="REPLACEABLE"
><I
>name</I
></TT
></TT
>.
        Example:
      </P
><PRE
CLASS="SCREEN"
># gnt-cluster search-tags time
/cluster ctime:2007-09-01
/nodes/node1.example.com mtime:2007-10-04</PRE
></DIV
><DIV
CLASS="REFSECT2"
><A
NAME="AEN513"
></A
><H3
>VERIFY</H3
><P
><B
CLASS="COMMAND"
>verify</B
>  [--no-nplus1-mem]</P
><P
>        Verify correctness of cluster configuration. This is safe with
        respect to running instances, and incurs no downtime of the
        instances.
      </P
><P
>        If the <CODE
CLASS="OPTION"
>--no-nplus1-mem</CODE
> option is given, Ganeti won't
        check whether if it loses a node it can restart all the instances on
        their secondaries (and report an error otherwise).
      </P
></DIV
><DIV
CLASS="REFSECT2"
><A
NAME="AEN521"
></A
><H3
>VERIFY-DISKS</H3
><P
><B
CLASS="COMMAND"
>verify-disks</B
> </P
><P
>        The command checks which instances have degraded DRBD disks
        and activates the disks of those instances.
      </P
><P
>        This command is run from the <B
CLASS="COMMAND"
>ganeti-watcher</B
>
        tool, which also has a different, complementary algorithm for
        doing this check. Together, these two should ensure that DRBD
        disks are kept consistent.
      </P
></DIV
><DIV
CLASS="REFSECT2"
><A
NAME="AEN528"
></A
><H3
>VERSION</H3
><P
><B
CLASS="COMMAND"
>version</B
> </P
><P
>        Show the cluster version.
      </P
></DIV
></DIV
><DIV
CLASS="REFSECT1"
><A
NAME="AEN533"
></A
><H2
>REPORTING BUGS</H2
><P
>      Report bugs to <A
HREF="http://code.google.com/p/ganeti/"
TARGET="_top"
>http://code.google.com/p/ganeti/</A
> or contact the
      developers using the Ganeti mailing list
      &lt;ganeti@googlegroups.com&gt;.
    </P
></DIV
><DIV
CLASS="REFSECT1"
><A
NAME="AEN537"
></A
><H2
>SEE ALSO</H2
><P
>      Ganeti overview and specifications:
      <SPAN
CLASS="CITEREFENTRY"
><SPAN
CLASS="REFENTRYTITLE"
>ganeti</SPAN
>(7)</SPAN
> (general overview),
      <SPAN
CLASS="CITEREFENTRY"
><SPAN
CLASS="REFENTRYTITLE"
>ganeti-os-interface</SPAN
>(7)</SPAN
> (guest OS definitions).

    </P
><P
>Ganeti commands:
      <SPAN
CLASS="CITEREFENTRY"
><SPAN
CLASS="REFENTRYTITLE"
>gnt-cluster</SPAN
>(8)</SPAN
> (cluster-wide commands),
      <SPAN
CLASS="CITEREFENTRY"
><SPAN
CLASS="REFENTRYTITLE"
>gnt-job</SPAN
>(8)</SPAN
> (job-related commands),
      <SPAN
CLASS="CITEREFENTRY"
><SPAN
CLASS="REFENTRYTITLE"
>gnt-node</SPAN
>(8)</SPAN
> (node-related commands),
      <SPAN
CLASS="CITEREFENTRY"
><SPAN
CLASS="REFENTRYTITLE"
>gnt-instance</SPAN
>(8)</SPAN
> (instance commands),
      <SPAN
CLASS="CITEREFENTRY"
><SPAN
CLASS="REFENTRYTITLE"
>gnt-os</SPAN
>(8)</SPAN
> (guest OS commands),
      <SPAN
CLASS="CITEREFENTRY"
><SPAN
CLASS="REFENTRYTITLE"
>gnt-backup</SPAN
>(8)</SPAN
> (instance import/export commands),
      <SPAN
CLASS="CITEREFENTRY"
><SPAN
CLASS="REFENTRYTITLE"
>gnt-debug</SPAN
>(8)</SPAN
> (debug commands).
    </P
><P
>Ganeti daemons:
      <SPAN
CLASS="CITEREFENTRY"
><SPAN
CLASS="REFENTRYTITLE"
>ganeti-watcher</SPAN
>(8)</SPAN
> (automatic instance restarter),
      <SPAN
CLASS="CITEREFENTRY"
><SPAN
CLASS="REFENTRYTITLE"
>ganeti-cleaner</SPAN
>(8)</SPAN
> (job queue cleaner),
      <SPAN
CLASS="CITEREFENTRY"
><SPAN
CLASS="REFENTRYTITLE"
>ganeti-noded</SPAN
>(8)</SPAN
> (node daemon),
      <SPAN
CLASS="CITEREFENTRY"
><SPAN
CLASS="REFENTRYTITLE"
>ganeti-masterd</SPAN
>(8)</SPAN
> (master daemon),
      <SPAN
CLASS="CITEREFENTRY"
><SPAN
CLASS="REFENTRYTITLE"
>ganeti-rapi</SPAN
>(8)</SPAN
> (remote API daemon).
    </P
></DIV
><DIV
CLASS="REFSECT1"
><A
NAME="AEN584"
></A
><H2
>COPYRIGHT</H2
><P
>      Copyright (C) 2006, 2007, 2008, 2009, 2010 Google Inc. Permission is
      granted to copy, distribute and/or modify under the terms of the
      <ACRONYM
CLASS="ACRONYM"
>GNU</ACRONYM
> General Public License as published by the Free Software
      Foundation; either version 2 of the License, or (at your option)
      any later version.
    </P
><P
>      On Debian systems, the complete text of the GNU General Public
      License can be found in /usr/share/common-licenses/GPL.
    </P
></DIV
></BODY
></HTML
>